tap "nikitabobko/tap"
brew "openssl@3"
brew "azure-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "gh"
brew "git"
brew "graphviz"
brew "neovim"
brew "node"
brew "protobuf", link: false
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "starship"
brew "tree"
brew "wget"
brew "wimlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
cask "nikitabobko/tap/aerospace"
cask "codex"
cask "font-caskaydia-cove-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
vscode "avetis.tokyo-night"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jithurjacob.nbpreviewer"
vscode "mhutchie.git-graph"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "yurchenkoy.tokyo-storm-dark-plus"
